#include "Dac.h"

sbit DAC_CS = P3^2;
sbit DAC_WR = P3^6;

//========================================================================
// 函数：void DacInit(void)
// 描述：DAC芯片初始化配置
// 参数：
// 返回：
// 版本：
//========================================================================
void DacInit(void)
{
	DAC_CS = 0;
}

//========================================================================
// 函数：void DacDataOut(uchar date)
// 描述：给DAC芯片输入数据
// 参数：
// 返回：
// 版本：
//========================================================================
void DacDataOut(uchar date)
{
	DAC_WR = 1;
	_nop_();
	P0 = date;
	_nop_();
	DAC_WR = 0;	
}
