#include "Uart.h"

#define FOSC 11059200L      //单片机系统主频
#define BAUD 9600           //波特率

uchar  UartRecData[11];  // I love MCU! 
uchar flag = 0;
//========================================================================
// 函数：void UartInit(void)
// 描述：串口硬件的初始化配置
// 参数：
// 返回：
// 版本：
//========================================================================
void UartInit(void)
{
    SCON = 0x50;            //选择串口方式1
	PCON = PCON & 0x7f;     //SMOD = 0
//    ES = 1;                 //使能串口中断，使用printf串口打印时屏蔽
    TMOD = 0x20;            //定时器1工作在8位自动重装模式下
    TH1 = TL1 = 256-(FOSC/12/32/BAUD);   //定时器1初值
    TR1 = 1;                //打开定时器1
	TI = 1;                 //printf串口打印的比必备条件
    EA = 1;                 //打开总中断
}

//========================================================================
// 函数：void Uart_Isr() interrupt 4
// 描述：串口中断函数
// 参数：
// 返回：
// 版本：
//========================================================================
void Uart_Isr() interrupt 4
{
	static uchar num = 0;
    if(RI == 1)   
    {
        RI = 0;              
        UartRecData[num] = SBUF; 
		num++;
		if(num == 11)
		{
			num = 0;
			flag = 1;
		}
    }
//    if(TI == 1)
//    {
//        TI = 0;            
//    }
}